WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
          // Add current to total timer count for freq average and
          // increment the GPIO input count.
          freqDcRtData->countTimerTotal += freqDcRtData->countLeadToLead;
          freqDcRtData->countInputTotal++;
        }
        else
        {
          freqDcRtData->countLeadToLead = 0;
          freqDcRtData->countLeadToTrail = 0;
        }

        freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING;
        break;
      }

      // Must be 16-bit timer
      uint32_t count1;
      uint32_t count2;

      if(freqDcRtData->activeState == MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING)
      {
        // Read current 16-bit values
        count1 = getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
        count2 = getreg16(timerBase + STM32_GTIM_CCR2_OFFSET);

        // Add each 16-bit CNT overflow to counts
        count1 += (freqDcRtData->leadToLeadOverflow * MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT);
        count2 += (freqDcRtData->leadToTrailOverflow * MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT);

        // Check for various detectable errors. There are some that cannot
        // be detected.

        // Since there's a limit to the highest frequency we can detect, we
        // need to check if we've gone beyond a reasonable frequency.
        if(count1 < MEADOW_FREQ_DC_MINIMUM_USABLE_CNT)
        {
          count1 = 0;
          count2 = 0;
        }
        else if(count1 < count2)
        {
          // This works in many cases, one is the initial frequency
          // that causes trouble (i.e. TimerClock/65536). However, it may be
          // that multiple overflow interrupts have been missed.
          count1 += MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT;
        }
        else
        {
          // Reasonable Duty Cycle test, must be > 1.0% and < 99.0%
          uint32_t dutyCycle = (count2 * 1000)/count1;
          if(dutyCycle < 10 || dutyCycle > 990)
          {
            count1 = 0;
            count2 = 0;
          }
        }
      }
      else
      {
        count1 = 0;
        count2 = 0;
      }

      // Provide consumer with values
      freqDcRtData->countLeadToLead = count1;
      freqDcRtData->countLeadToTrail = count2;

      // Add current to total timer count for freq average
      // and maintain the input count.
      freqDcRtData->countTimerTotal += count1;
      freqDcRtData->countInputTotal++;
      
      // Clear previous overflow
      freqDcRtData->leadToLeadOverflow = 0;
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING;
      break;

    // Trailing Edge
    case 0x05:    // Trailing edge with UIF (i.e. Trailing Edge + Overflow)
      timStatusReg &= ~GTIM_SR_UIF;

    case 0x04:    // Trailing edge alone. End of CCR2 capture.
      timStatusReg &= ~GTIM_SR_CC2IF;

      // Trailing edge check if there has been a valid leading edge
      if(freqDcRtData->activeState != MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING)
      {
        freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
        break;  // And quit
      }
      
      // Trailing edge means we're done with CCR2's value. We don't need
      // to worry about CNT overflow with respect to CCR2 either.
      if(timStatusReg & GTIM_SR_UIF)
        freqDcRtData->leadToLeadOverflow++;    // Adjust overflow count

      // Time to capture the first half overflow
      freqDcRtData->leadToTrailOverflow = freqDcRtData->leadToLeadOverflow;

      // This value will be tested when the leading edge arrives
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING;
      break;

    //------------------------------------------------------------
    case 0x06:    // (illegal) Rising and Falling together, no way
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    case 0x07:    // (illegal) Rising and Falling plus UIF
      // This case exists when the duty cycle is very small (< 0.5%) or very
      // large (> 99.5%)
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      timStatusReg &= ~GTIM_SR_UIF;
      freqDcRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    // There are only 3 bits to check, so this is a not needed. We've checked
    // all possible combinations
    default:
      break;
  }

  // Clear status register
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

  // (--) Diag
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);
  return OK;
}

//=============================================================
static uint32_t meadow_calc_freq_dc_get_apb_clock(
          struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  if(freqDcTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Uses the bit-field to determine the Timer clock
static uint32_t meadow_calc_freq_dc_get_max_clock(
          const struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  if(freqDcTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
static void meadow_calc_freq_dc_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
static void meadow_calc_freq_dc_enable(const uint32_t timerBase)
{
  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following finds the specified timer's built-in timer information.
struct freqDcTimerInfo_s *meadow_calc_freq_dc_get_timer_info(const int timerNumb)
{
  struct freqDcTimerInfo_s *timerInfo = &(freqTimerInfoArray[timerNumb - 1]);

  if(timerInfo->timerOkay)
    return timerInfo;

